Управление_пожарной_частью_/src/Documents/ПланСдачиНормативов/ПланСдачиНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланСдачиНормативов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Караул</name>
    <type>
      <types>CatalogRef.ГруппаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТренировки</name>
    <type>
      <types>CatalogRef.ТипТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.МестоПроведенияТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструктор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Упражнения</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Норматив</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>EnumRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Catalogs/ТипТренировки/ТипТренировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипТренировки</name>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Норматив</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_пожарной_частью_/src/Catalogs/ГруппаСотрудников/ГруппаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппаСотрудников</name>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>EnumRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_пожарной_частью_/src/Documents/ПланСдачиНормативов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТипТренировкиПриИзменении(Элемент)
    
    Объект.Упражнения.Очистить();
    Элементы.Упражнения.Обновить();
    
    Если Объект.ТипТренировки.Пустая() Тогда
        Возврат;
    КонецЕсли;
    
    НормативыТипаТренировки = ПолучитьНормативыТипаТренировкиНаСервере(Объект.ТипТренировки);
    
    Для Каждого НормативСсылка Из НормативыТипаТренировки Цикл
        НоваяСтрока = Объект.Упражнения.Добавить();
        НоваяСтрока.Норматив = НормативСсылка; 
    КонецЦикла;
    
КонецПроцедуры
&НаСервере
Функция ПолучитьНормативыТипаТренировкиНаСервере(ТипТренировкиСсылка)
	
	МассивНормативов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипТренировкиНормативы.Норматив КАК Норматив
	|ИЗ
	|	Справочник.ТипТренировки.Нормативы КАК ТипТренировкиНормативы
	|ГДЕ
	|	ТипТренировкиНормативы.Ссылка = &СсылкаТипаТренировки" ;
	
	Запрос.УстановитьПараметр("СсылкаТипаТренировки", ТипТренировкиСсылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНормативов.Добавить(Выборка.Норматив);
	КонецЦикла;
	
	Возврат МассивНормативов;
	
КонецФункции

&НаКлиенте
Процедура КараулПриИзменении(Элемент)

	Объект.Сотрудники.Очистить();
	
	Если Объект.Караул.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = ПолучитьСотрудниковКараулаНаСервере(Объект.Караул);
	
	Для Каждого СотрудникИнфо Из МассивСотрудников Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		НоваяСтрока.Сотрудник = СотрудникИнфо.Сотрудник;
		НоваяСтрока.Должность = СотрудникИнфо.Должность;
	КонецЦикла;
КонецПроцедуры   
&НаСервере
Функция ПолучитьСотрудниковКараулаНаСервере(КараулСсылка)
	
	МассивСотрудников = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СотрудникиГруппы.Сотрудник КАК Сотрудник,
	|    СотрудникиГруппы.Должность КАК Должность
	|ИЗ
	|    Справочник.ГруппаСотрудников.Сотрудники КАК СотрудникиГруппы
	|ГДЕ
	|    СотрудникиГруппы.Ссылка = &Караул";
	
	Запрос.УстановитьПараметр("Караул", КараулСсылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураСотрудника = Новый Структура;
		СтруктураСотрудника.Вставить("Сотрудник", Выборка.Сотрудник);
		СтруктураСотрудника.Вставить("Должность", Выборка.Должность);
		
		МассивСотрудников.Добавить(СтруктураСотрудника);
	КонецЦикла;

	Возврат МассивСотрудников;
	
КонецФункции
